Data Structures in pandas

Series    - 1D
DataFrame - 2D

what can do with pandas ?
we can do following things
- is there any corelation between two or more columns
- what is average value
- max value ?
- min value ?
- pandas also able to delete rows that are not relevent or containing wrong values like null or empty values. this is called cleanig the data

In [566]:
# importing pandas library
import pandas as pd

In [567]:
# series
# 1D - ndarray with axis label

In [568]:
# checking pandas version
print(pd.__version__)

2.1.1

syntax to create for Series

pd.Series(data,index)

In [569]:
s=[1,2,3,4,5]
print(type(s))

<class 'list'>

## creating series from list

In [570]:
s = pd.Series([1,2,3,4,5])
print(s)
print(type(s))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

## creating series from ndarray

In [571]:
import numpy as np
data = np.array([1,2,3,4,5])
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [572]:
# customizing the index numbers
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: object

## creating series from dictionary

In [573]:
names_dict={
    'jagan':97514,
    'raj':78932,
    'dhana':99402,
    'nanna':88837
}

population = pd.Series(names_dict)
print(s)
print(type(s))

100    a
101    b
102    c
103    d
dtype: object
<class 'pandas.core.series.Series'>

In [574]:
population['jagan'] # retreving the data by using label name explicitly - label given by user

97514

In [575]:
population.iloc[0] # retreving the data by using default index implicit by python

97514

In [576]:
population['jagan':'nanna'] # slicing

jagan    97514
raj      78932
dhana    99402
nanna    88837
dtype: int64

In [577]:
pd.Series([2,3,4])

0    2
1    3
2    4
dtype: int64

In [578]:
pd.Series([2,4,5],index=[100,200,300])

100    2
200    4
300    5
dtype: int64

In [579]:
s = pd.Series([2,4,5],index=[100,200,300])
s.reset_index() # this is dataframe
s

100    2
200    4
300    5
dtype: int64

In [580]:
series = pd.Series(['jagan','raju','dhana'],index=[28,30,21])
series

28    jagan
30     raju
21    dhana
dtype: object

why we using reset in series and dataframe ? 
lets look at the below example for better understand

series = pd.series(['jagan','raju'],index=[2,5])
in above example we have index that contains non continous numbers. so if we want to continous numbers in index field. 
then we can use reset()

In [581]:
# lets see orginal dataframe

data = {'Name':['Jai','Princi','Gurav','Anju','Geeku'],
       'Age':[27,24,22,32,15],
       'Address':['Delhi','Chennai','Hydrabad','Bangalore','Kolkatta'],
       'Qualification':['B.E','Bsc','MSC','MBA','B.Tech']}

# converting dictionary into dataframe

df = pd.DataFrame(data)
print('Orginal DataFrame')
print(df)

# example-1 => making own indexing withoout removing deafult index
index = ['a','b','c','d','e']
print()
df = pd.DataFrame(data,index)
print('Adding own index field to the dataframe')
print(df)

df.reset_index(inplace=True)
print()
print(df)

Orginal DataFrame
     Name  Age    Address Qualification
0     Jai   27      Delhi           B.E
1  Princi   24    Chennai           Bsc
2   Gurav   22   Hydrabad           MSC
3    Anju   32  Bangalore           MBA
4   Geeku   15   Kolkatta        B.Tech

Adding own index field to the dataframe
     Name  Age    Address Qualification
a     Jai   27      Delhi           B.E
b  Princi   24    Chennai           Bsc
c   Gurav   22   Hydrabad           MSC
d    Anju   32  Bangalore           MBA
e   Geeku   15   Kolkatta        B.Tech

  index    Name  Age    Address Qualification
0     a     Jai   27      Delhi           B.E
1     b  Princi   24    Chennai           Bsc
2     c   Gurav   22   Hydrabad           MSC
3     d    Anju   32  Bangalore           MBA
4     e   Geeku   15   Kolkatta        B.Tech

In [582]:
# example-2 making own indexing removing existing one
data = [1,2,3,4]
df = pd.DataFrame(data)
print('Orginal DataFrame with default index')
print(df)
print()

index = [2,4,8,10]
df = pd.DataFrame(data,index)
print('Removed existing index and added the own index')
print(df)

Orginal DataFrame with default index
   0
0  1
1  2
2  3
3  4

Removed existing index and added the own index
    0
2   1
4   2
8   3
10  4

In [583]:
# example-3 make index by using dataframe column with remove default index
data = {'Name':['Jai','Princi','Gurav','Anju','Geeku'],
       'Age':[27,24,22,32,15],
       'Address':['Delhi','Chennai','Hydrabad','Bangalore','Kolkatta'],
       'Qualification':['B.E','Bsc','MSC','MBA','B.Tech']}

df = pd.DataFrame(data)
df.set_index(df['Age'],inplace=True)
df

       Name  Age    Address Qualification
Age
27      Jai   27      Delhi           B.E
24   Princi   24    Chennai           Bsc
22    Gurav   22   Hydrabad           MSC
32     Anju   32  Bangalore           MBA
15    Geeku   15   Kolkatta        B.Tech

In [584]:
# example-4 make index by using dataframe column and without remove default index
data = {'Name':['Jai','Princi','Gurav','Anju','Geeku'],
       'Age':[27,24,22,32,15],
       'Address':['Delhi','Chennai','Hydrabad','Bangalore','Kolkatta'],
       'Qualification':['B.E','Bsc','MSC','MBA','B.Tech']}

index = ['a','b','c','d','e']
# converting dictionay to dataframe
df = pd.DataFrame(data,index)

# set the index by using dataframe column
df.set_index(['Age'],inplace=True)

# reset the index without removing default index
df.reset_index(level=['Age'],inplace=True)
print(df)

   Age    Name    Address Qualification
0   27     Jai      Delhi           B.E
1   24  Princi    Chennai           Bsc
2   22   Gurav   Hydrabad           MSC
3   32    Anju  Bangalore           MBA
4   15   Geeku   Kolkatta        B.Tech

### Create a Series by using Scaler

In [585]:
pd.Series(8)

0    8
dtype: int64

In [586]:
pd.Series(8,index=[100,200,300]) # single number in a series it will braodcaste the values

100    8
200    8
300    8
dtype: int64

In [587]:
# series using dictionary
pd.Series({1:'a',2:'b'})

1    a
2    b
dtype: object

In [588]:
pd.Series({1:'a',2:'b'},index=[2,1])

2    b
1    a
dtype: object

In [589]:
pd.Series({1:'j',4:'k',3:'l'},index=[1,3])  # it will select 1 and 3

1    j
3    l
dtype: object

In [590]:
df

   Age    Name    Address Qualification
0   27     Jai      Delhi           B.E
1   24  Princi    Chennai           Bsc
2   22   Gurav   Hydrabad           MSC
3   32    Anju  Bangalore           MBA
4   15   Geeku   Kolkatta        B.Tech

In [591]:
df.shape

(5, 4)

## DataFrame

- dataframe is 2 dimensional data structure. data is aligned by rows and columns.
- dataframe syntax
          => pd.DataFrame(data,index,columns)

In [592]:
# create a dataframe by using single list

data=[1,2,3]

df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3

In [593]:
# create a dataframe by using list of lists
data=[['Alon',28],['Bob',32],['Clark',38]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

    Name  Age
0   Alon   28
1    Bob   32
2  Clark   38

In [594]:
# create a dataframe by using list of lists adding datatype
data=[['Alon',28],['Bob',32],['Clark',38]]
# df = pd.DataFrame(data,columns=['Name','Age'],dtype='float')
df.info() # it will triger error because of string cannot convert into the integer or float

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [595]:
# create a dataframe by adding own index
data = {'Name':['Jagan','Dhana','Nag','Riya'],'Age':[24,21,41,12]}
df = pd.DataFrame(data,index=['rank-1','rank-2','rank-3','rank-4'])
df

         Name  Age
rank-1  Jagan   24
rank-2  Dhana   21
rank-3    Nag   41
rank-4   Riya   12

In [596]:
# reset index
df = df.reset_index()
df

    index   Name  Age
0  rank-1  Jagan   24
1  rank-2  Dhana   21
2  rank-3    Nag   41
3  rank-4   Riya   12

In [597]:
# when we reset the index, old index will add to the column
df.columns

Index(['index', 'Name', 'Age'], dtype='object')

In [598]:
# here we can rename the columns names
df.columns=['ranks','Name','Age']
df

    ranks   Name  Age
0  rank-1  Jagan   24
1  rank-2  Dhana   21
2  rank-3    Nag   41
3  rank-4   Riya   12

In [599]:
# create a dataframe from list of dictinaries
data = [{'a':1,'b':2},{'a':4,'b':5,'c':8}]
df = pd.DataFrame(data)
df

   a  b    c
0  1  2  NaN
1  4  5  8.0

In [600]:
data = [{'a':i,'b':2*i} for i in range(3)]
df = pd.DataFrame(data)
df # here you can see that all a and b are placed in dataframe column

   a  b
0  0  0
1  1  2
2  2  4

In [601]:
# custom indexing
df = pd.DataFrame(data,index=['X','Y','Z'])
df

   a  b
X  0  0
Y  1  2
Z  2  4

In [602]:
# get columns
df.columns

Index(['a', 'b'], dtype='object')

In [603]:
# rename the dataframe index
df.index=['m','n','o']
df

   a  b
m  0  0
n  1  2
o  2  4

In [604]:
data = [{'a':1,'b':2},{'b':3,'c':4}]
df = pd.DataFrame(data)
df

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [605]:
# create a dataframe from dict of series

data = {'one':pd.Series([1,2,3],index=['a','b','c']),
       'three':pd.Series([1,2,3,4],index=['a','b','c','d'])}
df = pd.DataFrame(data)
df

   one  three
a  1.0      1
b  2.0      2
c  3.0      3
d  NaN      4

In [606]:
# create a dataframe from numpy random 
pd.DataFrame(np.random.randn(3,2),columns=['Board','Infinity'])

      Board  Infinity
0 -0.421246  0.085010
1 -0.195661  1.994518
2 -0.589001  0.180185

In [607]:
pd.DataFrame(np.random.rand(3,2),columns=['Board','Infinity'],index=['a','b','c'])

      Board  Infinity
a  0.262641  0.657794
b  0.739510  0.562014
c  0.762683  0.497786

### indexer : loc and iloc

  this is very important
- implicit indexing - default index
- explicit indexing - user defined index

In [608]:
data = pd.Series(['a','b','c'],index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [609]:
# explicit index when indexing
data[1]

'a'

In [610]:
# implicit index when indexing
data[1:3] # jagan's defines its slice process by using default numers start with 0,1,2,3,4.etc

3    b
5    c
dtype: object

for slicing in python is implicit indexing and for Indexing in python is explicit indexing

In [611]:
data

1    a
3    b
5    c
dtype: object

In [612]:
# to come over this confusion about of implicit and explicit situation pandas provides iloc and loc
data.loc[1] # earlier we used to write data[1], now we are using data.loc[1] (loc is explicit)

'a'

In [613]:
# data.loc[2] # its give error. becoz explicit index have 1,3 and 5

In [614]:
data.iloc[2] # iloc is explicit index

'c'

In [615]:
data.loc[1:3] # slicing using explicit index

1    a
3    b
dtype: object

In [616]:
data.iloc[1:3] # slicing using implit index. its start index is 1 and end index is 3-1

3    b
5    c
dtype: object

In [617]:
# loc - label based index 
# iloc - integer based index

my_data = {'A':[1,2,3],'B':[4,5,6]}
my_df = pd.DataFrame(my_data,index=['row1','row2','row3'])
my_df.loc['row1':'row2','A']

row1    1
row2    2
Name: A, dtype: int64

In [618]:
my_data = {'A':[1,2,3],'B':[4,5,6]}
my_df = pd.DataFrame(my_data)
my_df.iloc[0:3,:2]

   A  B
0  1  4
1  2  5
2  3  6

Data Retrieval
- list of dictionaries
- csv files
- databases

In [619]:
# list of dictionaries
d = [ {'city':'Delhi','data':1000}, {'city':'Mumbai','data':2000}, 
     {'city':'Bangalore','data':1500} ]
pd.DataFrame(d)

        city  data
0      Delhi  1000
1     Mumbai  2000
2  Bangalore  1500

In [620]:
df = pd.read_csv("C:/users/jagan/downloads/student_records.csv")
df # dataframe has a collection of series

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [621]:
df.head(5)

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No

In [622]:
df.head(3)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y             90            85       Yes
1   John            C        N             85            51       Yes
2  David            F        N             10            17        No

In [623]:
# to get last 5 rows
df.tail()

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [624]:
df.tail(2)

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [625]:
np.ndim(df) # it gives 2-Dimensional structure of rows and columns # ndmin() is method

2

In [626]:
df.shape # shape is attribute

(8, 6)

In [627]:
# to findout some technical information, we can use info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           8 non-null      object
 1   OverallGrade   8 non-null      object
 2   Obedient       8 non-null      object
 3   ResearchScore  8 non-null      int64
 4   ProjectScore   8 non-null      int64
 5   Recommend      8 non-null      object
dtypes: int64(2), object(4)
memory usage: 516.0+ bytes

In [628]:
# to findout some statistics summary we can use describe()
df.describe()

       ResearchScore  ProjectScore
count       8.000000      8.000000
mean       63.375000     53.125000
std        31.640559     24.752705
min        10.000000     17.000000
25%        50.000000     32.250000
50%        75.000000     55.000000
75%        86.250000     73.000000
max        92.000000     85.000000

In [629]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [630]:
# column selection
df.Name

0     Henry
1      John
2     David
3    Holmes
4    Marvin
5     Simon
6    Robert
7     Trent
Name: Name, dtype: object

In [631]:
df.Recommend # its helps look only necessary columns

0    Yes
1    Yes
2     No
3     No
4     No
5    Yes
6     No
7     No
Name: Recommend, dtype: object

In [632]:
df['Recommend']  # another value- this method can be used space in the file name

0    Yes
1    Yes
2     No
3     No
4     No
5    Yes
6     No
7     No
Name: Recommend, dtype: object

In [633]:
type(df)

pandas.core.frame.DataFrame

In [634]:
type(df.Recommend)

pandas.core.series.Series

In [635]:
# how to select multiple columns
# df['OverallGrade','Recommend'] # this wil give an error. becoz we have to use here double brackts for giving multile column names
df[['OverallGrade','Recommend']]

  OverallGrade Recommend
0            A       Yes
1            C       Yes
2            F        No
3            B        No
4            E        No
5            A       Yes
6            B        No
7            C        No

In [636]:
df.columns # columns is a attribute

Index(['Name', 'OverallGrade', 'Obedient', 'ResearchScore', 'ProjectScore',
       'Recommend'],
      dtype='object')

In [637]:
print('Without All Columns')
print()
print(df.describe()) # usually describe will give statistics summary for numbers columns only.

# if we want summary for all columns then we can use this statement df.describe(include='all')
print()
print('With All Columns')
print()
print(df.describe(include='all'))

Without All Columns

       ResearchScore  ProjectScore
count       8.000000      8.000000
mean       63.375000     53.125000
std        31.640559     24.752705
min        10.000000     17.000000
25%        50.000000     32.250000
50%        75.000000     55.000000
75%        86.250000     73.000000
max        92.000000     85.000000

With All Columns

         Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
count       8            8        8       8.000000      8.000000         8
unique      8            5        2            NaN           NaN         2
top     Henry            A        Y            NaN           NaN        No
freq        1            2        5            NaN           NaN         5
mean      NaN          NaN      NaN      63.375000     53.125000       NaN
std       NaN          NaN      NaN      31.640559     24.752705       NaN
min       NaN          NaN      NaN      10.000000     17.000000       NaN
25%       NaN          NaN      NaN      50.000000     32.250000       NaN
50%       NaN          NaN      NaN      75.000000     55.000000       NaN
75%       NaN          NaN      NaN      86.250000     73.000000       NaN
max       NaN          NaN      NaN      92.000000     85.000000       NaN

In [638]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [639]:
ser = df.ProjectScore
print(ser)
print(type(ser))
print(ser.shape)

0    85
1    51
2    17
3    71
4    30
5    79
6    59
7    33
Name: ProjectScore, dtype: int64
<class 'pandas.core.series.Series'>
(8,)

In [640]:
df.shape

(8, 6)

In [641]:
list(df.columns)

['Name',
 'OverallGrade',
 'Obedient',
 'ResearchScore',
 'ProjectScore',
 'Recommend']

In [642]:
# rename the columns
df.columns=['Student_Name', 'OverallGrade', 'Obedient', 'ResearchScore', 'ProjectScore',
       'Recommend']
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
1         John            C        N             85            51       Yes
2        David            F        N             10            17        No
3       Holmes            B        Y             75            71        No
4       Marvin            E        N             20            30        No
5        Simon            A        Y             92            79       Yes
6       Robert            B        Y             60            59        No
7        Trent            C        Y             75            33        No

In [643]:
# summary for numeric columns
df.describe()

       ResearchScore  ProjectScore
count       8.000000      8.000000
mean       63.375000     53.125000
std        31.640559     24.752705
min        10.000000     17.000000
25%        50.000000     32.250000
50%        75.000000     55.000000
75%        86.250000     73.000000
max        92.000000     85.000000

In [644]:
# df.quantile('ResearchScore',.5)

In [645]:
df.ResearchScore.min()

10

In [646]:
df.ResearchScore.max()

92

In [647]:
df.ResearchScore.mean()

63.375

In [648]:
df.ResearchScore.count()

8

In [649]:
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
1         John            C        N             85            51       Yes
2        David            F        N             10            17        No
3       Holmes            B        Y             75            71        No
4       Marvin            E        N             20            30        No
5        Simon            A        Y             92            79       Yes
6       Robert            B        Y             60            59        No
7        Trent            C        Y             75            33        No

In [650]:
df.drop(['Recommend'],axis=1)

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore
0        Henry            A        Y             90            85
1         John            C        N             85            51
2        David            F        N             10            17
3       Holmes            B        Y             75            71
4       Marvin            E        N             20            30
5        Simon            A        Y             92            79
6       Robert            B        Y             60            59
7        Trent            C        Y             75            33

In [651]:
# remove more than two columns
df.drop(['Student_Name','OverallGrade'],axis=1)

  Obedient  ResearchScore  ProjectScore Recommend
0        Y             90            85       Yes
1        N             85            51       Yes
2        N             10            17        No
3        Y             75            71        No
4        N             20            30        No
5        Y             92            79       Yes
6        Y             60            59        No
7        Y             75            33        No

In [652]:
x = df.drop('Student_Name',axis=1)
x

  OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0            A        Y             90            85       Yes
1            C        N             85            51       Yes
2            F        N             10            17        No
3            B        Y             75            71        No
4            E        N             20            30        No
5            A        Y             92            79       Yes
6            B        Y             60            59        No
7            C        Y             75            33        No

In [653]:
# to get column names and data types we can use info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student_Name   8 non-null      object
 1   OverallGrade   8 non-null      object
 2   Obedient       8 non-null      object
 3   ResearchScore  8 non-null      int64
 4   ProjectScore   8 non-null      int64
 5   Recommend      8 non-null      object
dtypes: int64(2), object(4)
memory usage: 516.0+ bytes

In [654]:
# numeric columns
df.describe().columns

Index(['ResearchScore', 'ProjectScore'], dtype='object')

In [655]:
df.columns

Index(['Student_Name', 'OverallGrade', 'Obedient', 'ResearchScore',
       'ProjectScore', 'Recommend'],
      dtype='object')

In [656]:
#  generally non numeric columns we called has categorical columns.
list(set(x.columns)-set(x.describe().columns))

['Recommend', 'Obedient', 'OverallGrade']

In [657]:
set(x.columns)

{'Obedient', 'OverallGrade', 'ProjectScore', 'Recommend', 'ResearchScore'}

In [658]:
set(x.describe().columns)

{'ProjectScore', 'ResearchScore'}

In [659]:
set(x.columns)-set(x.describe().columns)

{'Obedient', 'OverallGrade', 'Recommend'}

In [660]:
category_columns = list(set(x.columns)-set(x.describe().columns))
category_columns

['Recommend', 'Obedient', 'OverallGrade']

In [661]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student_Name   8 non-null      object
 1   OverallGrade   8 non-null      object
 2   Obedient       8 non-null      object
 3   ResearchScore  8 non-null      int64
 4   ProjectScore   8 non-null      int64
 5   Recommend      8 non-null      object
dtypes: int64(2), object(4)
memory usage: 516.0+ bytes

In [662]:
numeric_types = df.select_dtypes(['int','float'])
numeric_types

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [663]:
# to find out numeric columns
numeric_type_columns = df.select_dtypes(include=['int','float']).columns
numeric_type_columns

Index(['ResearchScore', 'ProjectScore'], dtype='object')

In [664]:
# to findout categorical columns

# way -1
categorical_type = df.select_dtypes(include=['object']).columns
print('Way-1')
print(categorical_type)
print()

# way-2 
categorical_columns = df.select_dtypes(exclude=['int','float']).columns
print()
print('Way-2')
print(categorical_columns)

Way-1
Index(['Student_Name', 'OverallGrade', 'Obedient', 'Recommend'], dtype='object')


Way-2
Index(['Student_Name', 'OverallGrade', 'Obedient', 'Recommend'], dtype='object')

In [665]:
df[categorical_columns]

  Student_Name OverallGrade Obedient Recommend
0        Henry            A        Y       Yes
1         John            C        N       Yes
2        David            F        N        No
3       Holmes            B        Y        No
4       Marvin            E        N        No
5        Simon            A        Y       Yes
6       Robert            B        Y        No
7        Trent            C        Y        No

In [666]:
df[numeric_type_columns]

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [667]:
df.iloc[:,:]

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
1         John            C        N             85            51       Yes
2        David            F        N             10            17        No
3       Holmes            B        Y             75            71        No
4       Marvin            E        N             20            30        No
5        Simon            A        Y             92            79       Yes
6       Robert            B        Y             60            59        No
7        Trent            C        Y             75            33        No

In [668]:
df.iloc[0,0]

'Henry'

In [669]:
df.iloc[4,3]

20

In [670]:
df.iloc[:5,:]

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
1         John            C        N             85            51       Yes
2        David            F        N             10            17        No
3       Holmes            B        Y             75            71        No
4       Marvin            E        N             20            30        No

In [671]:
df.iloc[:5,:2]

  Student_Name OverallGrade
0        Henry            A
1         John            C
2        David            F
3       Holmes            B
4       Marvin            E

In [672]:
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
1         John            C        N             85            51       Yes
2        David            F        N             10            17        No
3       Holmes            B        Y             75            71        No
4       Marvin            E        N             20            30        No
5        Simon            A        Y             92            79       Yes
6       Robert            B        Y             60            59        No
7        Trent            C        Y             75            33        No

In [673]:
# filter the rows based on the condition
df['ResearchScore']>80

0     True
1     True
2    False
3    False
4    False
5     True
6    False
7    False
Name: ResearchScore, dtype: bool

In [674]:
# to findout students who got more than 80 marks in researchscore and projectscore
df[(df['ResearchScore']>=80) & (df['ProjectScore']>=80)]

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes

In [675]:
# findout the students who got project score>=70 and researchscore>=60 with names startwith 'H'
x = df[(df['ResearchScore']>=60) & (df['ProjectScore']>=70)]
x

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
3       Holmes            B        Y             75            71        No
5        Simon            A        Y             92            79       Yes

In [676]:
x[x['Student_Name'].str.startswith('H')]

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
3       Holmes            B        Y             75            71        No

In [677]:
# abobe two lines code will combining in one code
x[(x['ResearchScore']>=60) & (x['ProjectScore']>=70)][x['Student_Name'].str.startswith('H')]

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
3       Holmes            B        Y             75            71        No

In [678]:
df[df['ResearchScore']>=80]['Student_Name']

0    Henry
1     John
5    Simon
Name: Student_Name, dtype: object

In [679]:
x = list(df[df['ResearchScore']>=80]['Student_Name'])
x

['Henry', 'John', 'Simon']

In [680]:
df[df['ResearchScore']>=80]['Student_Name'].shape[0]

3

In [681]:
df[(df['ResearchScore']>=80)]['Student_Name'].shape[0]+47

50

In [682]:
# findout students who got morethan 80 marks in researchscore
df.where(df.ResearchScore>=80)

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y           90.0          85.0       Yes
1         John            C        N           85.0          51.0       Yes
2          NaN          NaN      NaN            NaN           NaN       NaN
3          NaN          NaN      NaN            NaN           NaN       NaN
4          NaN          NaN      NaN            NaN           NaN       NaN
5        Simon            A        Y           92.0          79.0       Yes
6          NaN          NaN      NaN            NaN           NaN       NaN
7          NaN          NaN      NaN            NaN           NaN       NaN

In [683]:
df['OverallGrade'].unique() # it help us to findout unique values

array(['A', 'C', 'F', 'B', 'E'], dtype=object)

In [684]:
df['Obedient'].unique() # this helps to understand overall datasets

array(['Y', 'N'], dtype=object)

In [685]:
df['OverallGrade'].value_counts() # how manys are got A,B,C,..

OverallGrade
A    2
C    2
B    2
F    1
E    1
Name: count, dtype: int64

In [686]:
df['Recommend'].value_counts()

Recommend
No     5
Yes    3
Name: count, dtype: int64

In [687]:
df['Recommend'].value_counts(normalize=True) # 62.5% recommended

Recommend
No     0.625
Yes    0.375
Name: proportion, dtype: float64

In [688]:
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
1         John            C        N             85            51       Yes
2        David            F        N             10            17        No
3       Holmes            B        Y             75            71        No
4       Marvin            E        N             20            30        No
5        Simon            A        Y             92            79       Yes
6       Robert            B        Y             60            59        No
7        Trent            C        Y             75            33        No

In [689]:
nparray = df.values
print(nparray)
print(type(nparray))
print(nparray.shape)

[['Henry' 'A' 'Y' 90 85 'Yes']
 ['John' 'C' 'N' 85 51 'Yes']
 ['David' 'F' 'N' 10 17 'No']
 ['Holmes' 'B' 'Y' 75 71 'No']
 ['Marvin' 'E' 'N' 20 30 'No']
 ['Simon' 'A' 'Y' 92 79 'Yes']
 ['Robert' 'B' 'Y' 60 59 'No']
 ['Trent' 'C' 'Y' 75 33 'No']]
<class 'numpy.ndarray'>
(8, 6)

In [690]:
df['ResearchScore']

0    90
1    85
2    10
3    75
4    20
5    92
6    60
7    75
Name: ResearchScore, dtype: int64

In [691]:
df['ResearchScore'].sum()

507

In [692]:
col_num = df.describe().columns
x = df[col_num]
x

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [693]:
x.sum() # by default axis=0

ResearchScore    507
ProjectScore     425
dtype: int64

In [694]:
x.sum(axis=1) # adding rows from left to right

0    175
1    136
2     27
3    146
4     50
5    171
6    119
7    108
dtype: int64

In [695]:
x.mean(axis=0)

ResearchScore    63.375
ProjectScore     53.125
dtype: float64

In [696]:
x.mean(axis=1)

0    87.5
1    68.0
2    13.5
3    73.0
4    25.0
5    85.5
6    59.5
7    54.0
dtype: float64

In [697]:
x.count(axis=0)

ResearchScore    8
ProjectScore     8
dtype: int64

In [698]:
x.count(axis=1)

0    2
1    2
2    2
3    2
4    2
5    2
6    2
7    2
dtype: int64

In [699]:
x

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [700]:
# adding the new column in x
x['TOTAL'] = x['ResearchScore'] + x['ProjectScore']
x

C:\Users\jagan\AppData\Local\Temp\ipykernel_2984\659988688.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x['TOTAL'] = x['ResearchScore'] + x['ProjectScore']

   ResearchScore  ProjectScore  TOTAL
0             90            85    175
1             85            51    136
2             10            17     27
3             75            71    146
4             20            30     50
5             92            79    171
6             60            59    119
7             75            33    108

In [701]:
# Percentage scored
x['PercentageScored'] = (x['TOTAL']/200)*100
x

C:\Users\jagan\AppData\Local\Temp\ipykernel_2984\4230848084.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x['PercentageScored'] = (x['TOTAL']/200)*100

   ResearchScore  ProjectScore  TOTAL  PercentageScored
0             90            85    175              87.5
1             85            51    136              68.0
2             10            17     27              13.5
3             75            71    146              73.0
4             20            30     50              25.0
5             92            79    171              85.5
6             60            59    119              59.5
7             75            33    108              54.0

In [702]:
x.PercentageScored = np.round(x['PercentageScored'],0)
x

C:\Users\jagan\AppData\Local\Temp\ipykernel_2984\3348290231.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.PercentageScored = np.round(x['PercentageScored'],0)

   ResearchScore  ProjectScore  TOTAL  PercentageScored
0             90            85    175              88.0
1             85            51    136              68.0
2             10            17     27              14.0
3             75            71    146              73.0
4             20            30     50              25.0
5             92            79    171              86.0
6             60            59    119              60.0
7             75            33    108              54.0

In [703]:
# lets change the percentagescored datatype into int by do this we have to use type casting astype()

x['PercentageScored'] = x['PercentageScored'].astype('int')
x

C:\Users\jagan\AppData\Local\Temp\ipykernel_2984\2645874826.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x['PercentageScored'] = x['PercentageScored'].astype('int')

   ResearchScore  ProjectScore  TOTAL  PercentageScored
0             90            85    175                88
1             85            51    136                68
2             10            17     27                14
3             75            71    146                73
4             20            30     50                25
5             92            79    171                86
6             60            59    119                60
7             75            33    108                54

In [704]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ResearchScore     8 non-null      int64
 1   ProjectScore      8 non-null      int64
 2   TOTAL             8 non-null      int64
 3   PercentageScored  8 non-null      int32
dtypes: int32(1), int64(3)
memory usage: 356.0 bytes

In [705]:
x['Lucky_Number'] = 28
x

C:\Users\jagan\AppData\Local\Temp\ipykernel_2984\276096419.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x['Lucky_Number'] = 28

   ResearchScore  ProjectScore  TOTAL  PercentageScored  Lucky_Number
0             90            85    175                88            28
1             85            51    136                68            28
2             10            17     27                14            28
3             75            71    146                73            28
4             20            30     50                25            28
5             92            79    171                86            28
6             60            59    119                60            28
7             75            33    108                54            28

In [706]:
# reading excel file

excel_file = pd.read_excel('c:/Users/jagan/Downloads/Staffing Data.xlsx')
excel_file.head()

  State Month  Demand
0     A   Jan    5240
1     A   Feb    4878
2     A   Mar    5942
3     A   Apr    2297
4     A   May    1992

### Filling missing values

In [707]:
# fillna is used to fill the values in NA places
df.iloc[1,1]=np.nan
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
1         John          NaN        N             85            51       Yes
2        David            F        N             10            17        No
3       Holmes            B        Y             75            71        No
4       Marvin            E        N             20            30        No
5        Simon            A        Y             92            79       Yes
6       Robert            B        Y             60            59        No
7        Trent            C        Y             75            33        No

In [708]:
df.iloc[1,2] = np.nan
df.iloc[1,5] = np.nan
df.iloc[1,3] = np.nan
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y           90.0            85       Yes
1         John          NaN      NaN            NaN            51       NaN
2        David            F        N           10.0            17        No
3       Holmes            B        Y           75.0            71        No
4       Marvin            E        N           20.0            30        No
5        Simon            A        Y           92.0            79       Yes
6       Robert            B        Y           60.0            59        No
7        Trent            C        Y           75.0            33        No

In [709]:
# now we can see that some missing values in df. so don't worry we can fill the values in NA places.
df.ResearchScore.fillna(8,axis=0,inplace=True)
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y           90.0            85       Yes
1         John          NaN      NaN            8.0            51       NaN
2        David            F        N           10.0            17        No
3       Holmes            B        Y           75.0            71        No
4       Marvin            E        N           20.0            30        No
5        Simon            A        Y           92.0            79       Yes
6       Robert            B        Y           60.0            59        No
7        Trent            C        Y           75.0            33        No

In [716]:
# lets do once again we set the null values in researchscore column
df.iloc[1,3] = np.nan
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y           90.0            85       Yes
1         John          NaN      NaN            NaN            51       NaN
2        David            F        N           10.0            17        No
3       Holmes            B        Y           75.0            71        No
4       Marvin            E        N           20.0            30        No
5        Simon            A        Y           92.0            79       Yes
6       Robert            B        Y           60.0            59        No
7        Trent            C        Y           75.0            33        No

In [714]:
np.round(df.ResearchScore.mean(),2)

60.29

In [723]:
# this time we filling mean value in missing value place. lets look into below code
df.ResearchScore.fillna(np.round(df.ResearchScore.mean(),2),axis=0,inplace=True)
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y          90.00            85       Yes
1         John          NaN      NaN          60.29            51       NaN
2        David            F        N          10.00            17        No
3       Holmes            B        Y          75.00            71        No
4       Marvin            E        N          20.00            30        No
5        Simon            A        Y          92.00            79       Yes
6       Robert            B        Y          60.00            59        No
7        Trent            C        Y          75.00            33        No

In [725]:
# lets check median and mean
df.ResearchScore.describe() # here mean and median are not equal. but there is small diffrence

count     8.000000
mean     60.286250
std      30.410122
min      10.000000
25%      50.000000
50%      67.645000
75%      78.750000
max      92.000000
Name: ResearchScore, dtype: float64

In [726]:
# lets try to treat the categorical values
df.Recommend.value_counts()

Recommend
No     5
Yes    2
Name: count, dtype: int64

In [728]:
df.Recommend.value_counts(normalize=True) # here we can see that 71.4% not recommeded, lets look at the mode of data

Recommend
No     0.714286
Yes    0.285714
Name: proportion, dtype: float64

In [730]:
df.Recommend.mode() # but there is problem with this, the output form of series

0    No
Name: Recommend, dtype: object

In [731]:
type(df.Recommend.mode())

pandas.core.series.Series

In [733]:
df.Recommend.mode()[0]

'No'

In [738]:
df.Recommend.fillna(df.Recommend.mode()[0],axis=0,inplace=True)
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y          90.00            85       Yes
1         John          NaN      NaN          60.29            51        No
2        David            F        N          10.00            17        No
3       Holmes            B        Y          75.00            71        No
4       Marvin            E        N          20.00            30        No
5        Simon            A        Y          92.00            79       Yes
6       Robert            B        Y          60.00            59        No
7        Trent            C        Y          75.00            33        No

lets treat categorical values in other way
- ffill - when we use ffil, basically its copying above data value to the null value place.
- bfill - simillarly we can use bfil its copying below data value to the null value place.

In [741]:
# lets look into obedient column
df.Obedient.fillna(method = 'ffill',inplace = True)
df

C:\Users\jagan\AppData\Local\Temp\ipykernel_2984\2009643535.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.Obedient.fillna(method = 'ffill',inplace = True)

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y          90.00            85       Yes
1         John          NaN        Y          60.29            51        No
2        David            F        N          10.00            17        No
3       Holmes            B        Y          75.00            71        No
4       Marvin            E        N          20.00            30        No
5        Simon            A        Y          92.00            79       Yes
6       Robert            B        Y          60.00            59        No
7        Trent            C        Y          75.00            33        No

In [742]:
# lets look into OverallGrade column
df.OverallGrade.fillna(method = 'bfill',inplace= True)
df

C:\Users\jagan\AppData\Local\Temp\ipykernel_2984\2943444540.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.OverallGrade.fillna(method = 'bfill',inplace= True)

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y          90.00            85       Yes
1         John            F        Y          60.29            51        No
2        David            F        N          10.00            17        No
3       Holmes            B        Y          75.00            71        No
4       Marvin            E        N          20.00            30        No
5        Simon            A        Y          92.00            79       Yes
6       Robert            B        Y          60.00            59        No
7        Trent            C        Y          75.00            33        No

when we have missing values in categorical columns, its advisable to use fill the mode of that column, if the column values are 
values are shuffled.

however if we see that data is grouped by we can use ffill or bfill as per which one is best fit

also you can fill the missing values by using constant

In [743]:
df.iloc[2,2]=np.nan
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y          90.00            85       Yes
1         John            F        Y          60.29            51        No
2        David            F      NaN          10.00            17        No
3       Holmes            B        Y          75.00            71        No
4       Marvin            E        N          20.00            30        No
5        Simon            A        Y          92.00            79       Yes
6       Robert            B        Y          60.00            59        No
7        Trent            C        Y          75.00            33        No

In [745]:
df.Obedient.fillna('N',inplace = True)
df

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y          90.00            85       Yes
1         John            F        Y          60.29            51        No
2        David            F        N          10.00            17        No
3       Holmes            B        Y          75.00            71        No
4       Marvin            E        N          20.00            30        No
5        Simon            A        Y          92.00            79       Yes
6       Robert            B        Y          60.00            59        No
7        Trent            C        Y          75.00            33        No

## GROUP BY, SPLIT, APPLY, COMBINE

In [765]:
df = pd.read_csv('https://github.com/jagann8/Machine_Learning/raw/main/student_records.csv')
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [766]:
dff = pd.DataFrame({'key':['A','B','C','A','B','C'],
                   'data':range(1,7)})
dff.key.unique()

array(['A', 'B', 'C'], dtype=object)

In [770]:
groupby_key = dff.groupby('key')

In [771]:
groupby_key.sum()

     data
key
A       5
B       7
C       9

In [772]:
groupby_key.mean()

     data
key
A     2.5
B     3.5
C     4.5

In [773]:
groupby_key.max()

     data
key
A       4
B       5
C       6

In [774]:
groupby_key.min()

     data
key
A       1
B       2
C       3

In [775]:
groupby_key.describe()

     data
    count mean      std  min   25%  50%   75%  max
key
A     2.0  2.5  2.12132  1.0  1.75  2.5  3.25  4.0
B     2.0  3.5  2.12132  2.0  2.75  3.5  4.25  5.0
C     2.0  4.5  2.12132  3.0  3.75  4.5  5.25  6.0

In [778]:
groupby_key.aggregate([min,'max','mean','std','var',np.std,'count'])

C:\Users\jagan\AppData\Local\Temp\ipykernel_2984\511903412.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  groupby_key.aggregate([min,'max','mean','std','var',np.std,'count'])
C:\Users\jagan\AppData\Local\Temp\ipykernel_2984\511903412.py:1: FutureWarning: The provided callable <function std at 0x000001D6DC8D1940> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  groupby_key.aggregate([min,'max','mean','std','var',np.std,'count'])

    data
     min max mean      std  var      std count
key
A      1   4  2.5  2.12132  4.5  2.12132     2
B      2   5  3.5  2.12132  4.5  2.12132     2
C      3   6  4.5  2.12132  4.5  2.12132     2